{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Marc Dobler | Web Developer, DIY Maker",
  "language": "en",
  "home_page_url": "https://www.marcdobler.com/",
  "feed_url": "https://www.marcdobler.com/feed/feed.json",
  "description": "Experiences, Self development DIY projects, How to sharing...",
  "author": {
    "name": "Marc Dobler",
    "url": "https://www.marcdobler.com/about-me/"
  },
  "items": [{
      "id": "https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/",
      "url": "https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/",
      "title": "Fish for 20G Nano Reefs",
      "content_html": "<h2 id=\"introduction\" tabindex=\"-1\">Introduction <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#introduction\" aria-hidden=\"true\">#</a></h2>\n<p>The purpose of this thread is to provide you with a comprehensive guide to fish for the nano reef aquarium.</p>\n<p>As for reefing, in general, is not an exact science the approach, I have taken to organizing this information is to provide a framework that includes my knowledge and experience with nano fish both as a hobbyist and professionally but also to encourage others to share their experience and knowledge for the benefit of everyone.</p>\n<h3 id=\"your-responsibility-as-a-fish-owner\" tabindex=\"-1\">Your responsibility as a fish owner <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#your-responsibility-as-a-fish-owner\" aria-hidden=\"true\">#</a></h3>\n<p>Fish are living things and deserve to be cared for as you would any other animal. Their life and well-being should not be valued by their price or just because they are easy to replace.</p>\n<p>As a fish owner, you should strive to give your fish the most natural life possible, respecting that you have removed this animal from its natural environment.</p>\n<p>To be straightforward, if you aren't willing to put forth the effort, time, money, and do the necessary research to properly take care of and create the ideal environment for your fish, you need to find a different hobby.</p>\n<h3 id=\"words-of-wisdom\" tabindex=\"-1\">Words of wisdom <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#words-of-wisdom\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Design your aquarium around what fish you would like to inhabit it with. Never expect a fish to just adapt to a less than adequate tank size.</li>\n<li>Plan your aquarium around the maximum size the fish will get. Just because it is a baby does not give you an excuse to keep it in a smaller tank.</li>\n<li>Regardless of what the fish guy at Walmart told you, fish do not only grow to the size of the tank you put them in.</li>\n<li>Fish stores are businesses and looking to make money. Some great fish stores really do care about their customers, their customer's tanks, and give out great advice. Unfortunately, that is not as often the case as it should be. Exercise extreme caution when taking advice from fish stores until you know they are really interested in helping you have an amazing tank and not just taking your money.</li>\n<li>Research, research, and more research! Learn everything you can!</li>\n</ul>\n<h2 id=\"how-to-use-this-guide\" tabindex=\"-1\">How to use this guide <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#how-to-use-this-guide\" aria-hidden=\"true\">#</a></h2>\n<h3 id=\"basic-overview\" tabindex=\"-1\">Basic overview <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#basic-overview\" aria-hidden=\"true\">#</a></h3>\n<p>There are four major sections in this guide: feeding, compatibility (coming soon), fish suggestions by tank size, and fish suggestions by a group. The feeding section allows you to get feeding suggestions based on diet type (carnivore, herbivore, omnivore, etc.) and more specifically by fish group, which includes more detailed info.</p>\n<p>The compatibility section will most likely be in the form of a table in which you will be able to see how the species interact with other fish species, corals, and invertebrates.</p>\n<p>In the fish, by tank size section a list of appropriate fish will follow each of the major divisions of tank sizes, as well, include a brief estimation of how many fish would be appropriate for that tank size. In the fish by group section, more detailed information will be provided about the major group each fish belongs to with some specific notes about each fish when necessary.</p>\n<p>You will also see an estimated maximum size the fish will grow to and the ideal tank size. The ideal tank size will be a compromise based on what is socially practiced by many nano-reefers and what is often recommended by experts. Some of these ideal tank sizes may be controversial and if you believe so, you are welcome to bring that up in this thread so we can all as a community discuss it.</p>\n<h3 id=\"things-to-keep-in-mind\" tabindex=\"-1\">Things to keep in mind <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#things-to-keep-in-mind\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Some of this will surely be my opinion or the opinion of others. If you feel strongly against something I have said, please pm me so we can discuss it and make changes if necessary.</li>\n<li>This is just to get you started--ultimately you need to do more research on your fish choice before buying</li>\n<li>Also, keep in mind I may list some things that are pushing it. I don’t know whether you are a beginner or expert if you know how to do a water change or not, so I will assume anyone who uses this guide has some common sense and basic understanding of nano reefing. For example, the fact that I list some fish appropriate for a 0.5g and 2.5g tank, does not automatically mean you should keep a fish in a tank that size. Rather, it means if you are capable of maintaining the added bioload of keeping a fish in a tank that size, then these fish would be appropriate choices.</li>\n<li>Don’t forget to keep your bioload in mind. While a dwarf lionfish may only get 4-6”, due to their diet, the contribution to the bioload of your tank will be much more significant.</li>\n</ul>\n<h3 id=\"how-you-can-contribute-to-this-thread\" tabindex=\"-1\">How you can contribute to this thread <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#how-you-can-contribute-to-this-thread\" aria-hidden=\"true\">#</a></h3>\n<p>Again, I would like to strongly encourage everyone to share his or her knowledge and experience. Please feel free to suggest additions, corrections, or other changes.</p>\n<p>Also, I've tried to make a note when a species is available captive-bred, so if you learn of a new species that is available, let me know!</p>\n<h2 id=\"general-feeding-info\" tabindex=\"-1\">General feeding info <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#general-feeding-info\" aria-hidden=\"true\">#</a></h2>\n<h3 id=\"general-thoughts\" tabindex=\"-1\">General thoughts <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#general-thoughts\" aria-hidden=\"true\">#</a></h3>\n<p>Meeting the nutritional needs of your fish is absolutely essential to their growth, survival, and reproduction. When feeding fish, we are trying to replicate not only what a fish eats, but when and how it eats in nature. The feeding preference of fish typically falls into one of five categories: carnivores, who eat meaty foods; herbivores, who eat plant matter; omnivores, who eat both meat and plants; piscivores, who eat other fish; and finally omnivores (detrivores), who obtain their energy from eating the animal and plant matter found within detritus.</p>\n<p>You can get a good idea of what to feed your fish just by figuring out what feeding category your fish falls into. It's important to remember that not only can you starve your fish, but you can actually overfeed them too, both of which can have negative health consequences.</p>\n<p>Fish are opportunistic eaters, meaning they never know when they will get their next meal, so eat whenever food is available. You may notice your fish eats anytime you put food in the aquarium, but that doesn't mean they are hungry, rather just taking advantage of an opportunity.</p>\n<p>While you need to feed your fish, you also need to limit feeding too.</p>\n<p>Overfeeding usually has drastic consequences on water quality anyways, so why would you want to put food in your tank if you don't have to. There are a few different types of food commonly available: live, flake/pellet / freeze-dried, frozen, and some hobbyists feed fresh meats and/or vegetable/algae.</p>\n<p>To keep things simple I am mostly going to stick with what the average reefer is feeding, which is usually a commercially prepared flake/pellet and/or commercially frozen foods. I am revisiting this topic later at some point to include live and fresh foods, but I won't really get into that right now.</p>\n<h3 id=\"a-few-things-to-keep-in-mind\" tabindex=\"-1\">A few things to keep in mind <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#a-few-things-to-keep-in-mind\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>The more variety the better...keep multiple types of food and switch things up frequently. Feed a general staple food such as plain frozen brine shrimp or a general omnivore flake food (such as ocean nutrition formula one) and then supplement that with a variety of other frozen, flake, fresh, and live foods.</li>\n<li>Stick with high-quality foods that are low in moisture, ash, and high in vitamins and nutrients.</li>\n<li>Use or mix in foods that are enhanced with HUFA, omega-3 fatty acids, and vitamin C. Liquid supplements are also available that can be added to any type of food.</li>\n<li><em><strong>Do not overfeed!</strong></em></li>\n<li>Again, I will provide you with suggestions, but ultimately it is up to you to research the nutritional requirements of your fish.</li>\n</ul>\n<p>Note: In making my suggestions I will refer to foods specifically made by Ocean Nutrition, H2O Life, and San Fransisco Bay Brand, given these are the brands I use and have the most experience with. There are many other high-quality manufactures of fish food though and those manufactures often have comparable products that you could use in place of the brands I mention if you wish.</p>\n<h3 id=\"feeding-schedule\" tabindex=\"-1\">Feeding schedule <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#feeding-schedule\" aria-hidden=\"true\">#</a></h3>\n<p>There really isn't a great well-summarizing answer to how often or how much you should feed your fish with a lot of what you hear being based on experience and/or opinion. Some people feed once a day, some feed every other day, and others feed small amounts several times a day. I don't think one way is right over the other, but for simplicity, will suggest a small amount once or twice a day.</p>\n<p>You want to try to incorporate in as much variety as you can. If you feed once a day, feed something different, or switch back and forth every day. If you feed twice a day, perhaps try frozen at the first feeding and flake at the second. Again, with feeding twice a day I'd suggest your second feeding complement what you did with your first feeding.</p>\n<p>For example, if in the morning you are fed a meaty high protein frozen food then use an algae/seaweed flake for the second feeding. The amount you feed...although I'm not a fan of rules of thumb, I think only feeding what your fish can fully eat in about 5 minutes is a good place to start.</p>\n<p>If it is all gone before 5 min, perhaps add a little more. If there is a lot of extra food flying around after 5 min, obviously you need to cut back. Any extra uneaten food will harm your water quality. Have a good sharp knife too because most likely you will be using fractions of frozen cubes, not the whole cube.</p>\n<p>For that reason, it can be easier to use frozen flat packs which make it easier to break off only what you need, if the frozen food type you want is available that way.</p>\n<h3 id=\"how-to-use-the-feeding-suggestion-guide\" tabindex=\"-1\"><strong>How to use the feeding suggestion guide</strong> <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#how-to-use-the-feeding-suggestion-guide\" aria-hidden=\"true\">#</a></h3>\n<p>There are two different ways you can use the feeding guide. I will provide feeding suggestions based on if the fish is a carnivore, herbivore, omnivore, piscivore, or detrivore and I will also provide feeding suggestions for each specific group of fish, noting species that do not follow trends of the group as a whole or have additional special needs.</p>\n<p>To save time, so I don't have to repeat myself, I'm going to make a list of the common foods by the manufacture, and then will refer to those foods by number in both sections of the guide.</p>\n<h3 id=\"food-list-by-the-manufacture\" tabindex=\"-1\">Food list by the manufacture <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#food-list-by-the-manufacture\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>\n<p><a href=\"http://www.oceannutrition.com/product_marine.php?lang=&amp;file=marine_formula.php&amp;head=\">Ocean Nutrition</a></p>\n<ul>\n<li>\n<p>Frozen:</p>\n<ol>\n<li>Formula 1</li>\n<li>Formula 2</li>\n<li>Brine Shrimp Plus</li>\n<li>Brine Shrimp Plus w/ HUFA</li>\n<li>Prime Reef</li>\n<li>Angel Formula</li>\n<li>Spirulina Formula</li>\n<li>Pygmy Angel Formula</li>\n</ol>\n</li>\n<li>\n<p>Flake/Other:<br />\n9. Formula 1<br />\n10. Formula 2<br />\n11. Prime Reef<br />\n12. Nano Formula</p>\n</li>\n<li>\n<p>Dry Seaweed:<br />\n13. Green/Brown/Red Algae/Seaweed</p>\n</li>\n</ul>\n</li>\n<li>\n<p><a href=\"http://www.h2olifefoods.com/old_standard.html\">H2O Life</a></p>\n<ul>\n<li>\n<p>Frozen:<br />\n14. Brine Shrimp<br />\n15. Mysis Shrimp<br />\n16. Cyclops<br />\n17. Spirulina/Brine Shrimp/Mysis Special Mix<br />\n18. Marine Fusion<br />\n19. Silversides IQF<br />\n20. Fresh Krill</p>\n</li>\n<li>\n<p>Dry Seaweed:<br />\n21. Green/Brown Seaweed</p>\n</li>\n</ul>\n</li>\n<li>\n<p><a href=\"http://www.sfbb.com/frozen.asp\">San Fransisco Bay Brand</a></p>\n<ul>\n<li>Frozen:<br />\n22. Brine Shrimp<br />\n23. Spirulina Enhanced Brine Shrimp<br />\n24. Marine Cuisine<br />\n25. Omega Brine<br />\n26. Angel and Butterfly<br />\n27. Emerald Entrée<br />\n28. Cyclops<br />\n29. Reef Plankton<br />\n30. Krill<br />\n31. Silversides</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"feeding-suggestions-by-diet-type\" tabindex=\"-1\">Feeding suggestions by diet type <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#feeding-suggestions-by-diet-type\" aria-hidden=\"true\">#</a></h3>\n<p><strong>Carnivores:</strong> 1,3,4,5,6,9,11,14,15,18,19,20,22,24,25,26,30,31</p>\n<p><strong>Herbivores:</strong></p>\n<ul>\n<li>Strictly Plant/Algae based: 2,7,10,13,21,27</li>\n<li>Blends that include Plant/Algae which herbivores can feed on 1,8,9,12,17,23</li>\n</ul>\n<p><strong>Omnivores:</strong> They will basically eat most of what is listed above. I'd recommend using the blended frozen/flake mixes and/or alternating between carnivore and herbivore froze/flake formulas.</p>\n<p><strong>Piscivores:</strong> 19,20,30,31</p>\n<h3 id=\"feeding-suggestions-by-fish-group\" tabindex=\"-1\">Feeding suggestions by fish group <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#feeding-suggestions-by-fish-group\" aria-hidden=\"true\">#</a></h3>\n<p>Coming soon!</p>\n<h2 id=\"nano-fish-compatibility\" tabindex=\"-1\">Nano fish compatibility <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#nano-fish-compatibility\" aria-hidden=\"true\">#</a></h2>\n<p>Coming Soon!</p>\n<h2 id=\"nano-fish-listed-by-tank-size\" tabindex=\"-1\">Nano fish listed by tank size <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#nano-fish-listed-by-tank-size\" aria-hidden=\"true\">#</a></h2>\n<p>Note: Suggestions for Seahorses by tank size can be found under the &quot;Seahorse&quot; heading in the next section of the guide, Nano Fish Listed By Group, for the time being.</p>\n<p><strong>Key</strong></p>\n<ul>\n<li>B = Beginner (Ideal for first-time fish owners and or new tanks)</li>\n<li>I = Intermediate (Ideal for hobbyists with established tanks)</li>\n<li>D = Difficult (Ideal for experience hobbyists who can meet the special needs of these fish)</li>\n<li>** = Available Tank Raised (Please let me know if I am missing any)</li>\n<li>V = Venomous</li>\n</ul>\n<p>Note: There is a lot of controversy around the idea of keeping saltwater fish in tanks under 10g. Whether or not it is ethical will be up to you to decide and not something I'm going to get into. Like it or not, the fact is there are going to be people who do it. Therefore, I would rather at least provide those people with some guidance to make good choices instead of just leaving them in the dark.</p>\n<p>Note Mandarins / Dragonets: There is a lot of controversy around the idea of keeping fish from the Dragonet family in nano tanks. Whether or not it is ethical will be for you to decide and not something I'm going to get into. I personally do not encourage people to keep dragonets in nano tanks, however, despite my feelings there a many who have successfully kept them in smaller tanks, therefore I will include them in this guide.</p>\n<h3 id=\"10g-(38-l)\" tabindex=\"-1\">10G (38 L) <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#10g-(38-l)\" aria-hidden=\"true\">#</a></h3>\n<p>(1 - 2 fish)</p>\n<p>Note: Keep in mind that the display area of all-in-one tanks holds less water than the total tank since some of that water is in the filtration area. When picking out fish, pick fish based on the display area volume, not the total tank volume.</p>\n<ul>\n<li>Blue Neon Goby — Stiphodon atropurpureus **</li>\n<li>Blue and Gold Blenny — Ecsenius lividanalis</li>\n<li>Broadstripe Goby — Elacatinus prochilos</li>\n<li>Catalina Goby — Lythrypnus dalli [cold water]</li>\n<li>Citron Goby — Gobiodon citrinus</li>\n<li>Clown Gobies — Gobiodon okinawae **</li>\n<li>Clown Goby, Black — Gobiodon strangulatus</li>\n<li>Court Jester Goby — Koumansetta rainfordi</li>\n<li>Deepwater Candy Basslet — Liopropoma carmabi</li>\n<li>Dracula Goby — Stonogobiops dracula</li>\n<li>Gold Neon Eviota Goby — Eviota pellucida</li>\n<li>Greenbanded Goby — Tigrigobius multifasciatus **</li>\n<li>Longspine Cardinalfish — Zoramia leptacantha</li>\n<li>Orange Spotted Goby — Amblyeleotris guttata</li>\n<li>Orange Stripe Goby — Amblyeleotris randalli</li>\n<li>Panda Goby — Paragobius lacunicolus</li>\n<li>Pygmy Coral Croucher Goby — Caracanthus unipinna</li>\n<li>Pinkbar Goby — Amblyeleotris aurora</li>\n<li>Panamic Barnacle Blenny — Acanthemblemaria hancocki</li>\n<li>Red Neon Eviota Goby — Eviota nigriventris</li>\n<li>Red Sea Mimic Blenny — Ecsenius gravieri</li>\n<li>Red Spotted Goby — Trimma rubromaculatus</li>\n<li>Red Striped Goby — Trimma cana</li>\n<li>Redhead Goby — Elacatinus puncticulatus **</li>\n<li>Swissguard Basslet — Liopropoma rubre</li>\n<li>Two Spot Goby — Signigobius biocellatus</li>\n<li>Tail Spot Blenny — Ecsenius stigmatura</li>\n<li>Trimma Goby — Trimma maiandros</li>\n<li>Two Spot Bimaculatus Blenny — Ecsenius bimaculatus</li>\n<li>Wheeler’s Shrimp Goby — Amblyeleotris wheeleri</li>\n<li>White Spotted Dwarf Goby — Trimma cf. caesiura</li>\n<li>Yasha White Ray Shrimp Goby — Stonogobiops yasha</li>\n<li>Yellow Neon Goby — Elacatinus figaro **</li>\n<li>Yellow Trimma Goby — Trimma kitrinum</li>\n<li>Zebra Catalina Goby — Lythrypnus zebra D</li>\n<li>Hi Fin Red Banded Goby — Stonogobiops nematodes</li>\n<li>Hector's Goby — Koumansetta hectori</li>\n<li>Jaguar Goby — Gobiopsis quinquecincta</li>\n<li>Cave Transparent Goby — Fusigobius pallidus</li>\n</ul>\n<h3 id=\"15g-(56-l)\" tabindex=\"-1\">15G (56 L) <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#15g-(56-l)\" aria-hidden=\"true\">#</a></h3>\n<ul>\n<li>Yellow Banded Possum Wrasse — Wetmorella nigropinnata D</li>\n<li>Caribbean Deepwater Cave Basslet — Liopropoma mowbrayi D</li>\n<li>Tanaka's Pygmy Wrasse — Wetmorella tanakai D</li>\n<li>White Banded Possum Wrasse — Wetmorella albofasciata D</li>\n<li>Pink-Streaked Wrasse — Pseudocheilinops ataenia D</li>\n</ul>\n<h3 id=\"20g-(76-l)\" tabindex=\"-1\">20G (76 L) <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#20g-(76-l)\" aria-hidden=\"true\">#</a></h3>\n<p>(2 - 3 fish)</p>\n<p>Note: Keep in mind that the display area of all-in-one tanks holds less water than the total tank since some of that water is in the filtration area. When picking out fish, pick fish based on the display area volume, not the total tank volume.</p>\n<ul>\n<li>Comical Blenny — Ecsenius opsifrontalis</li>\n<li>Ocellaris Clownfish (False Percula) — Amphiprion ocellaris B **</li>\n<li>Percula Clownfish (True Percula)** (1, if you want a pair, move up to 20G) — Amphiprion percula B</li>\n<li>Firefish Goby B —  Nemateleotris magnifica</li>\n<li>Red/Orange Angler — Antennarius sp.</li>\n<li>Wartskin Angler — Antennarius maculatus</li>\n<li>Painted frogfish — Antennarius pictus D</li>\n<li>Firefish, Helfrichi — Nemateleotris helfrichi</li>\n<li>Elegant firefish — Nemateleotris decora</li>\n<li>Pajama Cardinalfish — Sphaeramia nematoptera</li>\n<li>Exquisite Firefish — Nemateleotris exquisita</li>\n</ul>\n<h2 id=\"nano-fish-listed-by-fish-group\" tabindex=\"-1\">Nano fish listed by fish group <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#nano-fish-listed-by-fish-group\" aria-hidden=\"true\">#</a></h2>\n<p>Coming Soon!</p>\n<h2 id=\"sources\" tabindex=\"-1\">Sources <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/fish-for-20G-nano-reefs/#sources\" aria-hidden=\"true\">#</a></h2>\n<ul>\n<li><a href=\"https://www.nano-reef.com/\">Nano Reef</a></li>\n<li><a href=\"https://nanotank.com/\">Nano Tank</a></li>\n<li><a href=\"https://www.reef2reef.com/forums/nano-reefs.89/\">Reef 2 Reef</a></li>\n<li><a href=\"https://www.wikipedia.org/\">Wikipedia</a></li>\n<li><a href=\"https://fishkeepingguide.net/\">Fish Keeping Guide</a></li>\n<li><a href=\"https://reefbuilders.com/\">Reef Builders</a></li>\n<li><a href=\"https://www.liveaquaria.com/\">Live Aquaria</a></li>\n</ul>\n",
      "date_published": "2021-11-30T00:00:00Z"
    },{
      "id": "https://www.marcdobler.com/posts/how-to-calibrate-z-offset-with-a-bltouch-bed-leveling-probe/",
      "url": "https://www.marcdobler.com/posts/how-to-calibrate-z-offset-with-a-bltouch-bed-leveling-probe/",
      "title": "How to calibrate Z-Offset with a BLTouch bed leveling probe?",
      "content_html": "<h2 id=\"requirements\" tabindex=\"-1\">Requirements <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-calibrate-z-offset-with-a-bltouch-bed-leveling-probe/#requirements\" aria-hidden=\"true\">#</a></h2>\n<ul>\n<li>Any kind of software you can send GCODE through the terminal like Octoprint</li>\n<li>Piece of paper 90g/cm3</li>\n</ul>\n<h2 id=\"z-offset-instructions:\" tabindex=\"-1\">Z-Offset Instructions: <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-calibrate-z-offset-with-a-bltouch-bed-leveling-probe/#z-offset-instructions:\" aria-hidden=\"true\">#</a></h2>\n<ul>\n<li>G28 – Home 3D printer</li>\n<li>M851 Z0 – Reset Z0 Offset</li>\n<li>M500 – Store setting to EEPROM</li>\n<li>M501 – Set active parameters</li>\n<li>M503 – Display Active Parameters</li>\n<li>G28 Z – Home Z-Axis</li>\n<li>G1 F60 Z0 – Move nozzle to true 0 offset</li>\n<li>M211 S0 – Switch off soft endstops</li>\n<li>Move nozzle towards bed slowly until the paper can barely move</li>\n<li>Take note of the Z on the printer display (take that number and add the measurement of the calibration sheet or device used)</li>\n<li>M851 Z X.XX (X.XX being your z offset achieved)</li>\n<li>M211 S1 – Enable Soft Endstops</li>\n<li>M500 – Save settings to Eeprom</li>\n<li>M501 – Set Active Parameters</li>\n<li>M503 – display current settings</li>\n</ul>\n<p>Enjoy!</p>\n",
      "date_published": "2020-05-28T00:00:00Z"
    },{
      "id": "https://www.marcdobler.com/posts/Configuring-Marlin-2-0-for-an-Ender-3-Pro-and-BLTouch/",
      "url": "https://www.marcdobler.com/posts/Configuring-Marlin-2-0-for-an-Ender-3-Pro-and-BLTouch/",
      "title": "How to configure Marlin 2.0 for an Ender 3 / Pro and BLTouch",
      "content_html": "<h2 id=\"the-template\" tabindex=\"-1\">The Template <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/Configuring-Marlin-2-0-for-an-Ender-3-Pro-and-BLTouch/#the-template\" aria-hidden=\"true\">#</a></h2>\n<p>Firstly, you’ll need the Marlin firmware with the appropriate template settings.</p>\n<ol>\n<li>Start by downloading the latest stable release of Marlin from here and the configuration files here.</li>\n<li>Extract the zip.</li>\n<li>Copy the 4 files from config/examples/Creality/Ender-3 to the Marlin/ folder, overwriting the 2 already there.</li>\n</ol>\n<h2 id=\"configuration.h\" tabindex=\"-1\">Configuration.h <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/Configuring-Marlin-2-0-for-an-Ender-3-Pro-and-BLTouch/#configuration.h\" aria-hidden=\"true\">#</a></h2>\n<p>Open the new Marlin/Configuration.h file using a text editor suitable for code, like vs code. We’ll customize our configuration now:</p>\n<ol>\n<li>\n<p>Change <code>STRING_CONFIG_H_AUTHOR</code> to clearly differentiate the configuration from the default</p>\n</li>\n<li>\n<p>Disable <code>SHOW_BOOTSCREEN</code> and <code>SHOW_CUSTOM_BOOTSCREEN</code> to save space by commenting out the lines (prefix them with //  )</p>\n</li>\n<li>\n<p>Ensure you have the correct <code>BAUDRATE</code>. The original Ender 3 was configured to 115200 by Creality, but the newer Ender 3 Pro (and newer Creality motherboards) default to 250000. You may be fine with 250000 on an older Ender 3.</p>\n</li>\n<li>\n<p>Change <code>CUSTOM_MACHINE_NAME</code> to represent your printer, e.g. &quot;Ender 3 Pro&quot;</p>\n</li>\n<li>\n<p>If you’re using a BLTouch ABL sensor:</p>\n<ol>\n<li>Uncomment <code>#define BLTOUCH</code></li>\n<li><code>#define SERVO0_PIN 27</code> is not required to set up your BLTouch in Marlin 2.x, as it’s defined in the pins folder by default</li>\n<li>You’ll need to customize the offset between Probe and Extruder. In Marlin 1.x, this was done with X, Y, and 4. <code>Z_PROBE_OFFSET_FROM_EXTRUDER</code>. In Marlin 2.x, they’re now combined in <code>NOZZLE_TO_PROBE_OFFSET</code>. Instructions are in the comments. Using the Creality BLTouch Kit bracket, mine is { -43, -9, 0 }. It’s safer to leave Z as 0 here are calibrate this yourself later.</li>\n<li>To keep the probe away from the edge of the bed, increase <code>PROBING_MARGIN</code> to 20</li>\n<li>You can increase <code>XY_PROBE_SPEED</code> to 10000 to speed up probing slightly</li>\n<li>Uncomment #define <code>AUTO_BED_LEVELING_BILINEAR</code> to enable bilinear ABL</li>\n<li>By default, bilinear ABL uses a 3×3 grid. You can change this by editing <code>GRID_MAX_POINTS_X</code> under <code>EITHER</code>(<code>AUTO_BED_LEVELING_LINEAR</code>, <code>AUTO_BED_LEVELING_BILINEAR</code>). Mine is set to 5, for a 5×5 grid</li>\n<li>Uncomment <code>#define LCD_BED_LEVELING</code> to add bed leveling menu items</li>\n</ol>\n</li>\n<li>\n<p>If your bed is non-standard, you’ll need to adjust the size and/or travel limits to make sure Marlin knows this. I use bulldog clips to secure a glass bed. To ensure the nozzle stays clear of the clips, I’ve changed the following: <code>Y_BED_SIZE</code> from 235 to 199, <code>X_MIN_POS</code> from 0 to -2, <code>Y_MIN_POS</code> from 0 to -24.</p>\n</li>\n<li>\n<p>Uncomment <code>Z_SAFE_HOMING</code>. This prevents your Z homing from occurring without prior X and Y homing. Without this, you may accidentally miss the bed when homing Z.</p>\n</li>\n<li>\n<p>To increase the homing speed, increase <code>HOMING_FEEDRATE_XY</code> from (20<em>60) to (40</em>60) and <code>HOMING_FEEDRATE_Z</code> from (4<em>60) to (8</em>60).</p>\n</li>\n<li>\n<p>If you want to use PID to efficiently heat your bed, uncomment <code>#define PIDTEMPBED</code>. You’ll need to calibrate this later.</p>\n</li>\n<li>\n<p>If you’re using a “silent” Creality board v1.1.4 or v1.1.5, you’re using TMC2208 drivers in standalone mode. Uncomment X, Y, Z, and <code>E0_DRIVER_TYPE</code> and set them to <code>TMC2208_STANDALONE</code>.</p>\n</li>\n<li>\n<p>To save space, uncomment #define SLIM_LCD_MENUS. This will remove any menu items that you won’t need if controlling using a PC or OctoPrint.</p>\n</li>\n<li>\n<p>To save space, comment out <code>#define SPEAKER</code>. This will stop fully disable the speaker.</p>\n</li>\n<li>\n<p>To save space if you won’t be printing from an SD card, comment out #define <code>SDSUPPORT</code>.</p>\n</li>\n<li>\n<p>Save the file and close the file.</p>\n</li>\n</ol>\n<h2 id=\"configuration_adv.h\" tabindex=\"-1\">Configuration_adv.h <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/Configuring-Marlin-2-0-for-an-Ender-3-Pro-and-BLTouch/#configuration_adv.h\" aria-hidden=\"true\">#</a></h2>\n<p>Open the new Marlin/Configuration_adv.h file in your chosen text editor.</p>\n<ol>\n<li>If you’re using a BLTouch:\n<ol>\n<li>Uncomment <code>#define BLTOUCH_DELAY</code> and change from 500 to 200. This reduces the pause after each individual probe.</li>\n<li>Baby stepping allows the nozzle to move a tiny amount without changing the recorded coordinates for the hot-end. This is usually used for calibrating your Z Offset for a perfect first layer. You can increase <code>BABYSTEP_MULTIPLICATOR_Z</code> and <code>_XY</code> to 10 for faster motion.</li>\n<li>Uncomment <code>BABYSTEP_ZPROBE_OFFSET</code> and <code>#define BABYSTEP_ZPROBE_GFX_OVERLAY</code></li>\n</ol>\n</li>\n<li>If you want to use Linear Advance to increase your print quality at higher speeds, uncomment <code>#define LIN_ADVANCE</code> and set <code>LIN_ADVANCE_K</code> from 0.22 to 0, which will enable the feature but turn it off. Your GCODE will need to specify the K value, which you’ll calibrate later. You need different K values for different filament types. Note that LinearsAdvance is not compatible with the TMC2208 stepper driver in Standalone mode (using StealthChop), so will not worth it with Creality “silent” boards v1.1.4 and v1.1.5.</li>\n<li>To save space, comment out #define <code>ARC_SUPPORT</code>. This feature is used by other types of CNC machines, but usually not 3D printers.</li>\n<li>If you want to display progress and time remaining from another system with the M73 command, such as OctoPrint, uncomment <code>LCD_SET_PROGRESS_MANUALLY</code>. If your system will also send the M73 R parameter to update the time remaining, uncomment <code>USE_M73_REMAINING_TIME</code>.</li>\n<li>Marlin watches the rate of temperature increase for hot-end and bed. If it’s too slow, it will trigger an error and halt your print. If you have the windows open for ventilation and it’s cold out, this can be a problem. Increase <code>WATCH_BED_TEMP_PERIOD</code> a little if you have this issue.<br />\nSave your changes and close the file.</li>\n</ol>\n<h2 id=\"to-the-printer!\" tabindex=\"-1\">To The Printer! <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/Configuring-Marlin-2-0-for-an-Ender-3-Pro-and-BLTouch/#to-the-printer!\" aria-hidden=\"true\">#</a></h2>\n<p>Take a copy of your <code>M503</code> output to save your current printer settings. You’ll need to put some of these back later.</p>\n<p>Open Marlin/Marlin.ino with the Visual Studio Code, compile with PlateformIO, and write the new firmware to your printer.</p>\n<p>Run M502 to set all settings to those specified in your firmware files, then M500 to store these settings in the EEPROM.</p>\n<p>Depending on your configuration, you’ll now want to calibrate your Z-Probe Offset, PID for Hotend and Heated Bed and Linear Advance, or set them from your previous values.</p>\n<p>Enjoy!</p>\n",
      "date_published": "2020-05-20T00:00:00Z"
    },{
      "id": "https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/",
      "url": "https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/",
      "title": "How to compile and install wxPython on Raspberry Pi?",
      "content_html": "<p>If you need to install wxPython on Raspbian Buster for a project, the installation of that module can be a little bit tricky. It needs to be compiled for Raspbian from source files to have something working nicely.</p>\n<p>Here you can find step by step explanation of how to do it.</p>\n<h2 id=\"requirements\" tabindex=\"-1\">Requirements <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/#requirements\" aria-hidden=\"true\">#</a></h2>\n<ul>\n<li>Raspberry Pi</li>\n<li>Python 3.x</li>\n<li>time, lots of time</li>\n</ul>\n<h2 id=\"step-1\" tabindex=\"-1\">Step 1 <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/#step-1\" aria-hidden=\"true\">#</a></h2>\n<p>First, you need to open a terminal (shortcut ctrl + alt + t)</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">sudo</span> <span class=\"token function\">apt-get</span> update</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">sudo</span> <span class=\"token function\">apt-get</span> <span class=\"token function\">install</span> dpkg-dev build-essential libjpeg-dev libtiff-dev libsdl1.2-dev libgstreamer-plugins-base0.10-dev libnotify-dev freeglut3 freeglut3-dev libwebkitgtk-dev libghc-gtk3-dev libwxgtk3.0-gtk3-dev</code></pre>\n<p>if you use the pre-installed Python 3:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">sudo</span> <span class=\"token function\">apt-get</span> <span class=\"token function\">install</span> python3.7-dev</code></pre>\n<h2 id=\"step-2\" tabindex=\"-1\">Step 2 <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/#step-2\" aria-hidden=\"true\">#</a></h2>\n<p>Now, let’s make the virtual environment. I made mine right off the /home/pi directory, but you can put it anywhere. Some like to put all their virtual environments (virtenv) in specific locations.</p>\n<p>Let’s make one (wx is the name of the virtenv we are creating, change it to suit):</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token builtin class-name\">cd</span> ~</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\">python3 -m venv wx</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token builtin class-name\">source</span> ~/wx/bin/activate</code></pre>\n<h2 id=\"step-3\" tabindex=\"-1\">Step 3 <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/#step-3\" aria-hidden=\"true\">#</a></h2>\n<p>The first thing you need is wxPython.</p>\n<p>Go to:</p>\n<p><a href=\"https://pypi.org/project/wxPython/#files\">https://pypi.org/project/wxPython/#files</a></p>\n<p>Down of the bottom of the choices, you will see “wxPython-4.1.0.tar.gz … Source”.</p>\n<p>Download wxPython-4.1.0.tar.gz</p>\n<p>Use your browser if you can. The file should go into your ~/Downloads folder. The link currently is the very human unfriendly:</p>\n<p><a href=\"https://files.pythonhosted.org/packages/cb/4f/1e21d3c079c973ba862a18f3be73c2bbe2e6bc25c96d94df605b5cbb494d/wxPython-4.1.0.tar.gz\">https://files.pythonhosted.org/packages/cb/4f/1e21d3c079c973ba862a18f3be73c2bbe2e6bc25c96d94df605b5cbb494d/wxPython-4.1.0.tar.gz</a></p>\n<p>Okay, that’s not exactly a professional comment but sometimes you just have to call it what it is.</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token builtin class-name\">cd</span> ~</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">mv</span> ~Downloads/wxPython-4.1.0.tar.gz</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">tar</span> xf wxPython-4.1.0.tar.gz</code></pre>\n<p>Next step, make sure you are in the environment you want to install wxPython into.</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token builtin class-name\">cd</span> wxPython-4.1.0</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\">pip3 <span class=\"token function\">install</span> -r requirements.txt</code></pre>\n<p>The next part is the big one. This will take a while, anywhere from a few hours to 18+ hours on a Raspberry Pi Zero.</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">python3 build.py build bdist_wheel --jobs<span class=\"token operator\">=</span><span class=\"token number\">1</span></code></pre>\n<h2 id=\"after-waiting-~-8-hours\" tabindex=\"-1\">After waiting ~ 8 hours <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/#after-waiting-~-8-hours\" aria-hidden=\"true\">#</a></h2>\n<p>Now to install it in Python as a package (the name of this file varies depending on the Python version you build it with. ie. wxPython-4.1.0-cp38-cp38-linux_armv7l.whl for Python 3.8) :</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token builtin class-name\">cd</span> ~/wxPython-4.1.0/dist</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\">pip3 <span class=\"token function\">install</span> wxPython-4.1.0-cp37-cp37m-linux_armv7l.whl</code></pre>\n<h2 id=\"after-waiting-~-1-hour\" tabindex=\"-1\">After waiting ~ 1 hour <a class=\"direct-link\" href=\"https://www.marcdobler.com/posts/how-to-compile-and-install-wxPython-on-raspberry-pi/#after-waiting-~-1-hour\" aria-hidden=\"true\">#</a></h2>\n<p>Now let’s test it:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token builtin class-name\">cd</span> ~/wxPython-4.1.0.post2/demo</code></pre>\n<pre class=\"language-bash\"><code class=\"language-bash\">python3 demo.py</code></pre>\n<p>Enjoy!</p>\n",
      "date_published": "2020-05-18T00:00:00Z"
    }
  ]
}
